{
  "blogs": [
    {
      "title": "SFMC Admin Series",
      "tag": "SFMC Administrator",
      "teaser": "So you've taken the leap and purchased a brand new SFMC account… Cheers! Now, you're looking to get your account up and running. If you don't have experience with SFMC migrations or administration, it can be a daunting task to say the least. In this blog series, we'll review the necessary steps needed to set up your new SFMC instance and be ready to send your first marketing communication. Up first… User Setup!",
      "link": "https://steve-n-york.medium.com/sfmc-admin-series-part-1-user-setup-986205af5f50"
    },
    {
      "title": "Modular Development Within Salesforce Marketing Cloud",
      "tag": "Email Studio",
      "teaser": "Modular email development is a method of developing email templates in a way that promotes consistency and reusability. By breaking down the components of an email into smaller, reusable blocks, organizations can create a library of content that can be used to quickly build new emails. This approach to email development reduces the time and effort required to create new emails, as well as improves the consistency of design and messaging across all emails.",
      "link": "https://steve-n-york.medium.com/modular-development-within-salesforce-marketing-cloud-60efe611a11d"
    },
    {
      "title": "Email Deliverability Best Practices",
      "tag": "Email Marketing",
      "teaser": "Email deliverability refers to the ability of an email message to reach its intended recipient's inbox. It is a crucial aspect of email marketing and communication as it determines the effectiveness of campaigns and the ability to reach target audiences.<br><br>There are several factors that can affect email deliverability, including email content, sender reputation, email list quality, and email server configurations.",
      "link": "https://steve-n-york.medium.com/email-deliverability-refers-to-the-ability-of-an-email-message-to-reach-its-intended-recipients-a3b248df902f"
    }
  ]
}
